CSI API ETABS v1
cPropArea.GetWallAutoSelectList Method
 Retrieves property data for an auto select list wall section.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetWallAutoSelectList(
	string Name,
	ref string[] AutoSelectList,
	ref string StartingProperty
)
Function GetWallAutoSelectList (
	Name As String,
	ByRef AutoSelectList As String(),
	ByRef StartingProperty As String
) As Integer
Dim instance As cPropArea
Dim Name As String
Dim AutoSelectList As String()
Dim StartingProperty As String
Dim returnValue As Integer
returnValue = instance.GetWallAutoSelectList(Name,
	AutoSelectList, StartingProperty)
int GetWallAutoSelectList(
	String^ Name,
	array<String^>^% AutoSelectList,
	String^% StartingProperty
)
abstract GetWallAutoSelectList :
        Name : string *
        AutoSelectList : string[] byref *
        StartingProperty : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing auto select list wall property.
AutoSelectList
Type: System.String[]
 This is an array of the names of the wall properties included in the auto select list.
StartingProperty
Type: System.String
 This is Median or the name of a wall property in the AutoSelectList array. It is the starting section for the auto select list.
 Median indicates the Median Property by Thickness
Return Value
Type: Int32
 The function returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim WallPropType As eWallPropType
       Dim ShellType As eShellType
       Dim MatProp As String
       Dim Thickness As Double
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
       Dim AutoSelectList As String()
       Dim StartingProp As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new area property
       ret = SapModel.PropArea.SetWall("MyShellProp1A", eWallPropType.Specified, eShellType.ShellThick, "4000Psi", 11.1)
   'set new area property
       ret = SapModel.PropArea.SetWall("MyShellProp1B", eWallPropType.Specified, eShellType.ShellThin, "4000Psi", 12.2)
   'set new area property
       ret = SapModel.PropArea.SetWall("MyShellProp1C", eWallPropType.AutoSelectList, eShellType.ShellThick, "4000Psi", 13.3)
   'set new area property
       ret = SapModel.PropArea.SetWall("MyShellProp1D", eWallPropType.AutoSelectList, eShellType.ShellThick, "4000Psi", 14.4)
   'set new area property
       Dim tmpList As String()
       ReDim tmpList(2)
       tmpList(0) = "MyShellProp1A"
       tmpList(1) = "MyShellProp1B"
       tmpList(2) = "MyShellProp1C"
       ret = SapModel.PropArea.SetWallAutoSelectList("MyShellProp1D", tmpList, "MyShellProp1B")
   'get area property data
       ret = SapModel.PropArea.GetWall("MyShellProp1D", WallPropType, ShellType, MatProp, Thickness, Color, Notes, GUID)
   'get area property data
       ret = SapModel.PropArea.GetWallAutoSelectList("MyShellProp1D", AutoSelectList, StartingProp)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace